In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [41]:
df = pd.DataFrame(randn(5,4),'A B C D E'.split(),'W X Y Z'.split())

In [5]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [7]:
booldf = df>0

In [8]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [17]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [23]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [12]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [13]:
resultdf = df[df['Z']<0]

In [14]:
resultdf

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [18]:
resultdf['X']

C    0.740122
Name: X, dtype: float64

In [26]:
df[  (df['W']>0)  &  (df['Y']<0)  ]   #if you use 'and' keyword , it will give error

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [27]:
True and False

False

In [28]:
True & False  #Ampersand

False

In [29]:
True | False  #pipe

True

In [37]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [31]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [38]:
df.reset_index(inplace=True)

In [44]:
newind = 'CA NY WY OR CO'.split()

In [45]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [46]:
df['States'] = newind

In [47]:
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [50]:
df.set_index('States',inplace = True)

In [51]:
df

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

In [52]:
df.loc['new Row'] = np.zeros(4)

In [53]:
df

                W         X         Y         Z
States
CA      -0.993263  0.196800 -1.136645  0.000366
NY       1.025984 -0.156598 -0.031579  0.649826
WY       2.154846 -0.610259 -0.755325 -0.346419
OR       0.147027 -0.479448  0.558769  1.024810
CO      -0.925874  1.862864 -1.133817  0.610478
new Row  0.000000  0.000000  0.000000  0.000000

In [54]:
df.loc[['new Row'],['Y']] = 1

In [55]:
df

                W         X         Y         Z
States
CA      -0.993263  0.196800 -1.136645  0.000366
NY       1.025984 -0.156598 -0.031579  0.649826
WY       2.154846 -0.610259 -0.755325 -0.346419
OR       0.147027 -0.479448  0.558769  1.024810
CO      -0.925874  1.862864 -1.133817  0.610478
new Row  0.000000  0.000000  1.000000  0.000000